In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
#panda.series can assign index names
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
arr

array([10, 20, 30])

In [7]:
#can do the same with array or dictionary
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [10]:
#can hold caracter values or even functions
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
series1 = pd.Series([1,2,3,4], index=['USA','Germany','Russia','Japan'])

In [12]:
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [13]:
series2 = pd.Series([1,2,3,4], index=['USA','Germany','Italy','Japan'])

In [14]:
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [15]:
series1['USA']

1

In [16]:
series2['Germany']

2

In [17]:
series1+series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

In [18]:
#note the caps, if confused, one can always hit "tab" and it will autocomplete for seelction
#DataFrame essentially assigns dictionary to the dataframe - note the curly brackets
df = pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
df = pd.DataFrame(np.random.randn(5,4), index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])

In [20]:
df

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311
E -0.527979 -0.123003 -0.632645  0.049265

In [21]:
#selection and indexing
df['W']

A    0.343897
B    0.528261
C    0.539976
D   -0.559924
E   -0.527979
Name: W, dtype: float64

In [22]:
#multiple values, pull out as a list = double brackets
df[['W', 'Z']]

          W         Z
A  0.343897 -0.092788
B  0.528261  0.006683
C  0.539976  0.693158
D -0.559924 -0.613311
E -0.527979  0.049265

In [23]:
#similar to the $ notation in R, pandas dataframes can use a decimal point
df.W

A    0.343897
B    0.528261
C    0.539976
D   -0.559924
E   -0.527979
Name: W, dtype: float64

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
#create a new column based off a scalar or other functions
df['new']=df['W']+df['Y']

In [26]:
df

          W         X         Y         Z       new
A  0.343897  1.141926 -0.175230 -0.092788  0.168667
B  0.528261  0.358806  0.698951  0.006683  1.227213
C  0.539976  0.053039  0.176174  0.693158  0.716150
D -0.559924 -1.767256  0.606144 -0.613311  0.046220
E -0.527979 -0.123003 -0.632645  0.049265 -1.160624

In [27]:
#delete comlumns with .drop
#need to define axis = row=0, column=1
df.drop ('new', axis=1)

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311
E -0.527979 -0.123003 -0.632645  0.049265

In [28]:
df

          W         X         Y         Z       new
A  0.343897  1.141926 -0.175230 -0.092788  0.168667
B  0.528261  0.358806  0.698951  0.006683  1.227213
C  0.539976  0.053039  0.176174  0.693158  0.716150
D -0.559924 -1.767256  0.606144 -0.613311  0.046220
E -0.527979 -0.123003 -0.632645  0.049265 -1.160624

In [29]:
#note it was not a permanent solution
#to delete permanently, use inplace=True
df.drop ('new', axis=1, inplace=True)

In [30]:
df

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311
E -0.527979 -0.123003 -0.632645  0.049265

In [31]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311

In [32]:
#additional ways to index using loc (uses names to select and index rows and columns) and iloc (uses positions to select rows and columns)

df.loc['A']

W    0.343897
X    1.141926
Y   -0.175230
Z   -0.092788
Name: A, dtype: float64

In [33]:
df.iloc[2]

W    0.539976
X    0.053039
Y    0.176174
Z    0.693158
Name: C, dtype: float64

In [34]:
df.loc['B','Y']
#altrnatively df['B','Y']

0.6989513668684912

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.343897 -0.175230
B  0.528261  0.698951

In [36]:
#conditional subsetting
df

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311
E -0.527979 -0.123003 -0.632645  0.049265

In [37]:
df>0

       W      X      Y      Z
A   True   True  False  False
B   True   True   True   True
C   True   True   True   True
D  False  False   True  False
E  False  False  False   True

In [38]:
#returns all positons and the values for each of those whire were false
df[df > 0]

          W         X         Y         Z
A  0.343897  1.141926       NaN       NaN
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D       NaN       NaN  0.606144       NaN
E       NaN       NaN       NaN  0.049265

In [39]:
df[df['W']>0]

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158

In [40]:
#want only the things which fall under Y
df[df['W'] > 0]['Y']

A   -0.175230
B    0.698951
C    0.176174
Name: Y, dtype: float64

In [41]:
df[df['W'] > 0][['Y','X']]

          Y         X
A -0.175230  1.141926
B  0.698951  0.358806
C  0.176174  0.053039

In [42]:
#multiple conditional statements & and | -> note containment within ()
df[(df['W'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158

In [43]:
df

          W         X         Y         Z
A  0.343897  1.141926 -0.175230 -0.092788
B  0.528261  0.358806  0.698951  0.006683
C  0.539976  0.053039  0.176174  0.693158
D -0.559924 -1.767256  0.606144 -0.613311
E -0.527979 -0.123003 -0.632645  0.049265

In [44]:
#reset to a default labels
df.reset_index()

  index         W         X         Y         Z
0     A  0.343897  1.141926 -0.175230 -0.092788
1     B  0.528261  0.358806  0.698951  0.006683
2     C  0.539976  0.053039  0.176174  0.693158
3     D -0.559924 -1.767256  0.606144 -0.613311
4     E -0.527979 -0.123003 -0.632645  0.049265

In [45]:
new_index = 'CA NY WY OR CO'.split()
#else it would be new_index = ['CA' 'NY' 'WY' 'OR' 'CO']

In [46]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [50]:
df['States'] = new_index

In [51]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.343897  1.141926 -0.175230 -0.092788
NY      0.528261  0.358806  0.698951  0.006683
WY      0.539976  0.053039  0.176174  0.693158
OR     -0.559924 -1.767256  0.606144 -0.613311
CO     -0.527979 -0.123003 -0.632645  0.049265

In [52]:
df

          W         X         Y         Z States
A  0.343897  1.141926 -0.175230 -0.092788     CA
B  0.528261  0.358806  0.698951  0.006683     NY
C  0.539976  0.053039  0.176174  0.693158     WY
D -0.559924 -1.767256  0.606144 -0.613311     OR
E -0.527979 -0.123003 -0.632645  0.049265     CO

In [53]:
df.set_index('States',inplace=True)
#or could reassign df as set.index

In [54]:
df

               W         X         Y         Z
States
CA      0.343897  1.141926 -0.175230 -0.092788
NY      0.528261  0.358806  0.698951  0.006683
WY      0.539976  0.053039  0.176174  0.693158
OR     -0.559924 -1.767256  0.606144 -0.613311
CO     -0.527979 -0.123003 -0.632645  0.049265

In [55]:
#hierarchical dataframes multi-indexed data frames
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
#that forms tuples based off of outside and inside
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [56]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [57]:
df=pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1 -0.937060  1.144279
   2  0.806694  1.675009
   3  0.053736  0.629981
G2 1 -0.315814  0.828429
   2 -1.377777 -0.354486
   3 -0.983166  0.405655

In [58]:
df.loc['G1']

          A         B
1 -0.937060  1.144279
2  0.806694  1.675009
3  0.053736  0.629981

In [59]:
#defines which row to pull out
df.loc['G1'].loc[1]

A   -0.937060
B    1.144279
Name: 1, dtype: float64

In [60]:
df.index.names

FrozenList([None, None])

In [61]:
df.index.names =['Group','Num']

In [62]:
df

                  A         B
Group Num
G1    1   -0.937060  1.144279
      2    0.806694  1.675009
      3    0.053736  0.629981
G2    1   -0.315814  0.828429
      2   -1.377777 -0.354486
      3   -0.983166  0.405655

In [63]:
#xs instead of loc
df.xs('G1')

            A         B
Num
1   -0.937060  1.144279
2    0.806694  1.675009
3    0.053736  0.629981

In [64]:
df.xs(['G1',1])

A   -0.937060
B    1.144279
Name: (G1, 1), dtype: float64

In [65]:
#will return both values at group level
df.xs(1,level='Num')

              A         B
Group
G1    -0.937060  1.144279
G2    -0.315814  0.828429